[
  {
    "event_key": "63",
    "active": "Y",
    "name": "Gordon's Special Session",
    "event_start": "2015-11-17 11:15:00",
    "event_end": "2015-11-17 12:00:00",
    "event_type": "Docker Docker Docker",
    "seats": "0",
    "goers": "20",
    "invite_only": "N",
    "venue": "Level 1, Room 112",
    "id": "04a8cf96485086fad02190053899f92e",
    "venue_id": "375424",
    "speakers": "Evan Hazlett, Banjot Chanana"
  },
  {
    "event_key": "22",
    "active": "Y",
    "name": "Container torture: run any binary in any running container. 0 patch.",
    "event_start": "2015-11-17 15:55:00",
    "event_end": "2015-11-17 16:40:00",
    "event_type": "Black Belt Tech",
    "description": "Running a container app in the container is easy, attaching a custom app to a running container is a bit trickier. But, what if I wanted to run any arbitrary binary in any arbitrary running container? Common wisdom says it's impossible. Is it ? This talk dives into containers internals, just above the kernel surface and demonstrates that this is, indeed possible. With a bit of C magic and ptrace.<br \/>",
    "seats": "0",
    "goers": "44",
    "invite_only": "N",
    "venue": "Level 1, Room 111",
    "id": "052c65dc94da43ebb53592a241db0f93",
    "venue_id": "378156",
    "speakers": "Jean-Tiare Le Bigot"
  },
  {
    "event_key": "27",
    "active": "Y",
    "name": "Using Docker and SDN for telco application development and deployment",
    "event_start": "2015-11-16 11:45:00",
    "event_end": "2015-11-16 12:30:00",
    "event_type": "Use Case",
    "description": "In this talk we will present how at Bell-Labs (Alcatel-Lucent R&amp;D division) we benefit from using Docker in combination with the SDN solution from Nuage Networks for development and deployment of a next-gen chat-based communication platform. This communication platform does intensive data analytics, runs a number of multi-media services and can control remote appliances (e.g. thermostats, robots, cameras, etc). We will illustrate the stringent telco requirements to successfully operate such a communication platform, including some non-functional needs like high-availability, reliability, elasticity, QoS and lifecycle management. Furthermore, we will explain why we selected docker as a hosting platform and how we have utilized it. We will also share some of the deployment scenarios we are facing and how these are addressed by combining Docker and Nuage VSP. Lastly, we will share the lessons we have learned during this development process, and propose some improvements\/extensions for Docker to evolve into an application stack that is able to meet the stringent needs of telco applications.&nbsp;",
    "seats": "0",
    "goers": "52",
    "invite_only": "N",
    "venue": "Level 1, Room 114",
    "id": "0da0eedaebd63c1b8c1a6d6852ea076a",
    "venue_id": "378155",
    "speakers": "Nico Janssens"
  },
  {
    "event_key": "19",
    "active": "Y",
    "name": "Lunch & Exhibit Hours",
    "event_start": "2015-11-17 12:00:00",
    "event_end": "2015-11-17 13:30:00",
    "event_type": "break",
    "seats": "0",
    "goers": "119",
    "invite_only": "N",
    "venue": "Exhibit Hall 4-8",
    "id": "0fdcd1d3b4de61662f6df07db0947dd7",
    "venue_id": "378152"
  },
  {
    "event_key": "64",
    "active": "Y",
    "name": "Deploying and Managing Containers for Developers",
    "event_start": "2015-11-17 13:30:00",
    "event_end": "2015-11-17 14:15:00",
    "event_type": "Docker Docker Docker",
    "description": "As a developer, you want to build and deploying applications to be easy. Build it once and deploy it wherever you want. Tutum makes it easy. In this session, you&rsquo;ll learn how Tutum can be part of your CI\/CD pipeline.",
    "seats": "0",
    "goers": "45",
    "invite_only": "N",
    "venue": "Level 1, Room 112",
    "id": "111300c031b5553c152d32ec6d4cec70",
    "venue_id": "375424",
    "speakers": "Borja Burgos, Fernando Mayo"
  },
  {
    "event_key": "15",
    "active": "Y",
    "name": "Breakfast & Exhibit Hours",
    "event_start": "2015-11-17 08:00:00",
    "event_end": "2015-11-17 09:00:00",
    "event_type": "break",
    "seats": "0",
    "goers": "120",
    "invite_only": "N",
    "venue": "Exhibit Hall 4-8",
    "id": "11519b656314f9eb52ddf4996a3f3e5d",
    "venue_id": "378152"
  },
  {
    "event_key": "46",
    "active": "Y",
    "name": "Production-Ready Containers from IBM and Docker",
    "event_start": "2015-11-17 11:15:00",
    "event_end": "2015-11-17 12:00:00",
    "event_type": "Ecosystem",
    "description": "<p>IBM and Docker continue to build on their partnership to deliver production-ready containers. &nbsp;<br \/>Attend this session to learn how IBM&rsquo;s commitment to open source and enterprise expertise&nbsp;<br \/>combined with Docker container technology has resulted in solutions which provide the&nbsp;<br \/>management and security needed for production environments. In this session, we will provide&nbsp;an update on the IBM and Docker partnership as well as discuss and demonstrate: &nbsp;<\/p>\r\n<ul>\r\n<li>Docker Trusted Registry resold by IBM which includes IBM&rsquo;s world-class support and&nbsp;<\/li>\r\n<li>Integration with our DevOps solution, UrbanCode<\/li>\r\n<li>IBM Containers on Bluemix which leverage the open source Docker engine, therefore&nbsp;<\/li>\r\n<li>supporting your existing Docker images and Dockerfiles<\/li>\r\n<li>How you can leverage the familiar Docker CLI against the IBM Bluemix cloud for standard&nbsp;<\/li>\r\n<li>commands and the Cloud Foundry CLI plug-in for the IBM added capabilities<\/li>\r\n<li>Ways to integrate deployed containers with any existing app or service from the Bluemix&nbsp;<\/li>\r\n<li>catalog (120+ across DevOps, Analytics, Big Data, IoT, Watson, and Databases)<\/li>\r\n<li>Use of the scalable container group deployment with integrated load balancer and optional&nbsp;<\/li>\r\n<li>auto-recovery and GoRoute domain name<\/li>\r\n<li>Integrated monitoring and logging at the container or container group level<\/li>\r\n<li>Security compliance insight to any Docker image in the registry regardless of source (IBM&nbsp;<\/li>\r\n<li>image, public Docker Hub, or automated creation via DevOps Pipeline) using the Vulnerability&nbsp;<\/li>\r\n<li>Advisor<\/li>\r\n<li>How IBM product teams, such as MobileFirst Platform and StrongLoop, are offering Docker&nbsp;<\/li>\r\n<li>images in the IBM registry as a means to improve adoption efficiency<\/li>\r\n<\/ul>",
    "seats": "0",
    "goers": "39",
    "invite_only": "N",
    "venue": "Level 1, Room 118-119",
    "id": "11c9b82db6f50c7be5e8b57d300d3674",
    "venue_id": "378153",
    "speakers": "Jason McGee, Chris Rosen"
  },
  {
    "event_key": "18",
    "active": "Y",
    "name": "How to be successful running Docker in Production",
    "event_start": "2015-11-17 11:15:00",
    "event_end": "2015-11-17 12:00:00",
    "event_type": "Black Belt Tech",
    "description": "<p>John&rsquo;s presentation will cover his lessons learned from running Docker in Production @ SalesforceIQ. Learn how to scale your registry using AWS and S3. Should you use Device Mapper or AUFS? Why run Swarm, Mesos, Kubernetes, or neither. Finally, know how persistent storage (Kafka, Cassandra, or SQL) can be run successfully with Docker in Production<\/p>\r\n<p>His team focuses on Docker based solutions to power their SaaS infrastructure and developer operations.<\/p>",
    "seats": "0",
    "goers": "133",
    "invite_only": "N",
    "venue": "Level 1, Room 111",
    "id": "1233cb8321714b6815a7ef6ca9944186",
    "venue_id": "378156",
    "speakers": "John Fiedler"
  },
  {
    "event_key": "28",
    "active": "Y",
    "name": "Using Docker with NoSQL",
    "event_start": "2015-11-16 14:00:00",
    "event_end": "2015-11-16 14:45:00",
    "event_type": "Use Case",
    "description": "<p>Understanding internal operations is crucial in financial services. Are public interfaces running smoothly? Are the back-end business systems as productive as they could be? Are infrastructure resources being allocated correctly based on business need? These are exactly the kind of questions that organizations must be able to answer but, surprisingly, they struggle with these questions. Called The Salamander, the tool has provided the bank an unparalleled ability to optimise and simplify business IT processes, which ultimately saves costs and leads to an improved customer experience. The Salamander team designed a solution running on a cloud computing architecture with several NoSQL solutions as Neo4J, MongoDB, REDIS,.... With these repositories they generate data visualisations that clearly demonstrate the relationship between among operations. The front-end and back-end of the application communicate via RESTFUL APIs and NodeJS-based servers provide elasticity when accessing the stored data. The new challenges are related with the need of load and use specific result sets stored and useful to diagnosis but not for immediate reading. At this point appears Docker appears as a solution to offer fast and easy custom database service.&nbsp;<\/p>",
    "seats": "0",
    "goers": "44",
    "invite_only": "N",
    "venue": "Level 1, Room 114",
    "id": "1255d9d9f2741b085f0f2a27041a2487",
    "venue_id": "378155",
    "speakers": "Manuel Eusebio de Paz Carmona"
  },
  {
    "event_key": "1",
    "active": "Y",
    "name": "Pre-Registration",
    "event_start": "2015-11-15 17:30:00",
    "event_end": "2015-11-15 19:00:00",
    "event_type": "Pre-Registration, Registration",
    "description": "Get your badge and swag before the crowds start on Monday!",
    "seats": "0",
    "goers": "86",
    "invite_only": "N",
    "venue": "Entrance Hall",
    "id": "13af0eae74d92608637ecb34350e4792",
    "venue_id": "378150"
  },
  {
    "event_key": "60",
    "active": "Y",
    "name": "Docker Orchestration at Production Scale",
    "event_start": "2015-11-16 14:55:00",
    "event_end": "2015-11-16 15:40:00",
    "event_type": "Docker Docker Docker",
    "description": "<p>Docker Swarm provides clustering and scheduling capabilities for IT ops teams responsible for deploying and managing applications. &nbsp;Attend this session to learn more about how the recent GA release of Swarm scales and works with Networking and Compose to deploy your apps into production.<\/p>\r\n<br \/>",
    "seats": "0",
    "goers": "118",
    "invite_only": "N",
    "venue": "Level 1, Room 112",
    "id": "170f84ccce8a4e9a79b032a11ada5aca",
    "venue_id": "375424",
    "speakers": "Victor Vieux, Andrea Luzzardi"
  },
  {
    "event_key": "69",
    "active": "Y",
    "name": "Kernel load-balancing for Docker containers using IPVS",
    "event_start": "2015-11-16 14:00:00",
    "event_end": "2015-11-16 14:45:00",
    "event_type": "Black Belt Tech",
    "description": "Many companies use expensive proprietary hardware and software to provide load-balancing and routing for their users and services. I'm going to demonstrate how the same or even exceeding performance and feature set can be achieved using an open-source technology which has been a part of the mainline Linux kernel for over a decade &ndash; IPVS. Specifically, you'll see how IPVS can be used to automatically configure load balancing and routing for Docker containers using a simple Go daemon and a Docker plugin.",
    "seats": "0",
    "goers": "60",
    "invite_only": "N",
    "venue": "Level 1, Room 111",
    "id": "1b97f00149d9f6b9c6297cce919c195f",
    "venue_id": "378156",
    "speakers": "Andrey Sibiryov"
  },
  {
    "event_key": "39",
    "active": "Y",
    "name": "Continuous Integration with Jenkins, Docker and Compose",
    "event_start": "2015-11-17 13:30:00",
    "event_end": "2015-11-17 14:15:00",
    "event_type": "Use Case",
    "description": "<p>Oxford University Press (OUP) recently started the Oxford Global Languages (OGL) initiative (http:\/\/www.oxforddictionaries.com\/words\/oxfordlanguages) which aims at providing language resources for digitally under represented languages. In August 2015 OUP launched two African languages websites for Zulu (http:\/\/zu.oxforddictionaries.com) and Northern Sotho (http:\/\/nso.oxforddictionaries.com). The backend of these websites is based on an API retrieving data in RDF from a triple store and delivering data to the frontend in JSON-LD.&nbsp;<br \/><br \/>The entire micro-service infrastructure for development, staging, and production runs on Docker containers in Amazon EC2 instances. In particular, we use Jenkins to rebuild the Docker image for the API based on a Python Flask application and Docker Compose to orchestrate the containers. A typical CI workflow is as follows:&nbsp;<br \/><br \/>- a developer commits code to the codebase&nbsp;<br \/>- Jenkins triggers a job to run unit tests&nbsp;<br \/>- if the unit tests are successful, the Docker image of the Python Flask application is rebuilt and the container is restarted via Docker Compose&nbsp;<br \/>- if the unit tests or the Docker build failed, the monitor view shows the Jenkins jobs in red and displays the name of the possible culprit who broke the build.&nbsp;<br \/><br \/>A demo of this CI workflow is available at http:\/\/www.sandrocirulli.net\/continuous-integration-with-jenkins-docker-and-compose&nbsp;<\/p>\r\n<p>&nbsp;<\/p>",
    "seats": "0",
    "goers": "70",
    "invite_only": "N",
    "venue": "Level 1, Room 114",
    "id": "1e41fe2a959175626386f07c5efd439f",
    "venue_id": "378155",
    "speakers": "Sandro Cirulli"
  },
  {
    "event_key": "4",
    "active": "Y",
    "name": "Short Stack with the New Stack Breakfast and Podcast",
    "event_start": "2015-11-16 08:00:00",
    "event_end": "2015-11-16 09:00:00",
    "event_type": "break",
    "description": "Have a Short Stack with the New Stack. Followed by a Podcast presented by the New Stack Analysts.&nbsp;<br \/><br \/>Sponsored by Intel&nbsp;",
    "media_url": "http:\/\/schd.ws\/hosted_files\/dockerconeu2015\/0a\/New Stack.png",
    "seats": "0",
    "goers": "117",
    "invite_only": "N",
    "venue": "Exhibit Hall 4-8",
    "id": "22788a012bd7a096836ee4388b5b6755",
    "venue_id": "378152"
  },
  {
    "event_key": "36",
    "active": "Y",
    "name": "Trading Bitcoin with Docker",
    "event_start": "2015-11-17 11:15:00",
    "event_end": "2015-11-17 12:00:00",
    "event_type": "Use Case",
    "description": "<p>Bity is an internet money gateway built by Swiss Bitcoin Exchange ( SBEX ). To trade bitcoin the entire infrastructure of Bity is running in Docker containers. All the components of the infrastructure are using Docker, from the frontend applications and load balancer, the Django based backend, replicated Postgres database, Bitcoin daemon and remittance engine. All software goes through a CI pipeline that starts with Docker images being built on private repositories in Docker hub. Developers take also advantage of a docker-compose definition that allows them to run the entire infrastructure on a single laptop. Finally the production deployments happen thanks to the Ansible Docker module on a CloudStack based public cloud. Everything has been automated to ease re-deployment and operations. This presentation will go through every component and how Docker has enabled us to go production in 4 months.&nbsp;<\/p>",
    "seats": "0",
    "goers": "27",
    "invite_only": "N",
    "venue": "Level 1, Room 114",
    "id": "245d16d1aa3eb657aef69173fae77e99",
    "venue_id": "378155",
    "speakers": "Sebastien Goasguen"
  },
  {
    "event_key": "33",
    "active": "Y",
    "name": "Shipping Manifests, Bill of Lading and Docker - Metadata for Containers",
    "event_start": "2015-11-16 14:55:00",
    "event_end": "2015-11-16 15:40:00",
    "event_type": "Wild Cards",
    "description": "Shipping Manifests, Bill of Lading and Docker - Metadata for Containers<br \/>The shipping container metaphor for Docker points to many of the advantages of building and running software using containers. But what about other essential parts of the shipping container ecosystem like the shipping manifest and bill of lading?<br \/>Many of the most powerful features of traditional package management tools like apt or yum are based on metadata associated with the packages. You can find out who created a package and when, check where a particular file came from, whether the package has a known vulnerability and more. What would this capability look like for Docker containers?<br \/>This talk will look at the power of metadata for containers, in particular:<br \/>* Docker provides labels for associating metadata with images and containers but how best to use them?* What problems can be solved by agreeing on standards for container metadata?* Exposing standard commands and endpoints to expose metadata about what is inside a container* Demo some open source toolings and also look at the sort of tools we might build atop those standards and low-level tools.&nbsp;",
    "seats": "0",
    "goers": "30",
    "invite_only": "N",
    "venue": "Level 1, Room 113",
    "id": "28d66bc64eda4a7271b6c7b8998c1940",
    "venue_id": "375421",
    "speakers": "Gareth Rushgrove"
  },
  {
    "event_key": "17",
    "active": "Y",
    "name": "Break ",
    "event_start": "2015-11-17 10:30:00",
    "event_end": "2015-11-17 11:15:00",
    "event_type": "break",
    "seats": "0",
    "goers": "103",
    "invite_only": "N",
    "venue": "Exhibit Hall 4-8",
    "id": "2bdb5a1764ca2f3b0f4a16f6466aa618",
    "venue_id": "378152"
  },
  {
    "event_key": "13",
    "active": "Y",
    "name": "DockerCon Party! (buses depart at 7:30pm)",
    "event_start": "2015-11-16 20:15:00",
    "event_end": "2015-11-16 23:00:00",
    "event_type": "Party",
    "seats": "0",
    "goers": "146",
    "invite_only": "N",
    "venue": "Maritime Museum Barcelona",
    "id": "33573dfbc50b608376d4411fa14a701f",
    "venue_id": "358457"
  },
  {
    "event_key": "37",
    "active": "Y",
    "name": "Stop Being Lazy and Test Your Software",
    "event_start": "2015-11-16 17:20:00",
    "event_end": "2015-11-16 18:05:00",
    "event_type": "Wild Cards",
    "description": "<p>Testing software is necessary, no matter the size or status of your company. Introducing Docker to your development workflow can help you write and run your testing frameworks more efficiently, so that you can always deliver your best product to your customers and there are no excuses for not writing tests anymore. You&rsquo;ll walk away from this talk with practical advice for using Docker to run your test frameworks more efficiently, as well as some solid knowledge of software testing principles.<\/p>\r\n<br \/>",
    "seats": "0",
    "goers": "48",
    "invite_only": "N",
    "venue": "Level 1, Room 113",
    "id": "3545066e9cbe4e086117f46b96a438bb",
    "venue_id": "375421",
    "speakers": "Laura Frank"
  },
  {
    "event_key": "8",
    "active": "Y",
    "name": "Lunch & Exhibit Hours",
    "event_start": "2015-11-16 12:30:00",
    "event_end": "2015-11-16 14:00:00",
    "event_type": "break",
    "seats": "0",
    "goers": "130",
    "invite_only": "N",
    "venue": "Exhibit Hall 4-8",
    "id": "392ba5f3270667bac7f42a87f01acea7",
    "venue_id": "378152"
  },
  {
    "event_key": "30",
    "active": "Y",
    "name": "Docker & PCI-DSS - Lessons learned about introducing Docker in a security sensitive environment",
    "event_start": "2015-11-16 11:45:00",
    "event_end": "2015-11-16 12:30:00",
    "event_type": "Wild Cards",
    "description": "In the recent past there were quite some discussions about security in the context of introducing or using Docker. It is true that there are some gaps to be closed but the whole story does not start from square one either. At Amadeus we are using Docker to build our future-oriented services and to introduce devops culture. Due to the nature of our business we have to deal with Security certifications like PCI-DSS, SSAE 16 and ISO 27001. This talks described the challenges we were facing in that context and how we mastered them. The story has technical and non-technical aspects.&nbsp;",
    "seats": "0",
    "goers": "62",
    "invite_only": "N",
    "venue": "Level 1, Room 113",
    "id": "4343182786a065ae0caa80ab4171a4eb",
    "venue_id": "375421",
    "speakers": "Udo Seidel"
  },
  {
    "event_key": "66",
    "active": "Y",
    "name": "Official Repos and Project Nautilus",
    "event_start": "2015-11-17 15:55:00",
    "event_end": "2015-11-17 16:40:00",
    "event_type": "Docker Docker Docker",
    "description": "<p>Attend this session to learn more about Official Repositories and the process behind securing and maintaining images in collaboration with upstream partners. &nbsp;Also we will introduce Project Nautilus.<\/p>\r\n<br \/>",
    "seats": "0",
    "goers": "22",
    "invite_only": "N",
    "venue": "Level 1, Room 112",
    "id": "4566b0a09572cf2bb546c56f646897dc",
    "venue_id": "375424",
    "speakers": "Justen Stepka, Mario Ponticello, Krish Garimella"
  },
  {
    "event_key": "32",
    "active": "Y",
    "name": "Containing IoT sensor telemetry",
    "event_start": "2015-11-16 14:00:00",
    "event_end": "2015-11-16 14:45:00",
    "event_type": "Wild Cards",
    "description": "In this hour we consider benefits of interfacing docker with IoT systems using sensor telemetry and actuator telecommand technology. IoT has come a long way by embracing web interfaces like JavaScript and NodeJS, but lacks good packaging and container abstraction allowing for portability across hardware platforms. We bridge this inadequacy by introducing Docker and IoT to each other.&nbsp;",
    "seats": "0",
    "goers": "20",
    "invite_only": "N",
    "venue": "Level 1, Room 113",
    "id": "4919d5d09526985bc9185678f67adbd1",
    "venue_id": "375421",
    "speakers": "Michael Schloh von Bennewitz, Samuel Cozannet"
  },
  {
    "event_key": "67",
    "active": "Y",
    "name": "How are containers enabling 20th Century Fox to release the next great movie?",
    "event_start": "2015-11-16 14:00:00",
    "event_end": "2015-11-16 14:45:00",
    "event_type": "Ecosystem",
    "description": "Technology is a core piece of the film-making process, enabling creators, directors and actors to tell a compelling story. More than anything, those movies and the entertainment of the future tests the power of modern technologies and the alignment of those tools with the people who use them.<br \/> <br \/>In this Q&amp;A session between HPE and 20th Century Fox, you will hear about how 20th Century Fox has selected to use Docker containers through HPE&rsquo;s Helion Development Platform to deliver movies to deliver high-tech movie productions.&nbsp;Speakers will share an enterprise-level view of the journey, Docker technology in the enterprise, and how the partnership with HPE is helping them deliver faster, more efficient solutions to their business, and more engaging movies to people like us.",
    "seats": "0",
    "goers": "43",
    "invite_only": "N",
    "venue": "Level 1, Room 118-119",
    "id": "53527810dd836d4acee8e972d64f8cca",
    "venue_id": "378153",
    "speakers": "Devon Bleak, Manav Mishra"
  },
  {
    "event_key": "14",
    "active": "Y",
    "name": "Registration ",
    "event_start": "2015-11-17 08:00:00",
    "event_end": "2015-11-17 18:00:00",
    "event_type": "Registration",
    "seats": "0",
    "goers": "24",
    "invite_only": "N",
    "venue": "Entrance Hall",
    "id": "57ecdd019e361ac079a0193c21497345",
    "venue_id": "378150"
  },
  {
    "event_key": "31",
    "active": "Y",
    "name": "Placing a container on a train at 200 mph",
    "event_start": "2015-11-16 16:25:00",
    "event_end": "2015-11-16 17:10:00",
    "event_type": "Use Case",
    "description": "At Uber, we've been introducing Docker to give service owners more control over their environments. However, everything at Uber is moving very fast so we have had to do it a way such that Docker fitted into the existing infrastructure and services could be migrated seamlessly to Docker without any service interruptions. In this talk we will talk about the challenges we faced while doing this, such as handling both non-Docker and Docker builds, image replication, integration with our deployment systems and other challenges when deploying Docker at scale.",
    "seats": "0",
    "goers": "45",
    "invite_only": "N",
    "venue": "Level 1, Room 114",
    "id": "617de604594927fae06eedda8e4f06d9",
    "venue_id": "378155",
    "speakers": "Casper Svenning Jensen"
  },
  {
    "event_key": "25",
    "active": "Y",
    "name": "Live migrating a container: pros, cons and gotchas",
    "event_start": "2015-11-16 17:20:00",
    "event_end": "2015-11-16 18:05:00",
    "event_type": "Black Belt Tech",
    "description": "&nbsp;In this talk I will briefly show why you might want to live migrate a container, why you might want to avoid doing this and what can be done instead. The main topic of the talk would to demonstrate why live migrating a container is more complex than live migrating a virtual machines and what can be done with this complexity.&nbsp;<br \/>",
    "seats": "0",
    "goers": "70",
    "invite_only": "N",
    "venue": "Level 1, Room 111",
    "id": "62e6d2ea7380442a48fafaeee26c9842",
    "venue_id": "378156",
    "speakers": "Pavel Emelyanov"
  },
  {
    "event_key": "10",
    "active": "Y",
    "name": "Break",
    "event_start": "2015-11-16 15:40:00",
    "event_end": "2015-11-16 16:25:00",
    "event_type": "break",
    "seats": "0",
    "goers": "107",
    "invite_only": "N",
    "venue": "Exhibit Hall 4-8",
    "id": "6345caa20d10b51f8872ff243a117b63",
    "venue_id": "378152"
  },
  {
    "event_key": "61",
    "active": "Y",
    "name": "Understanding Docker Security",
    "event_start": "2015-11-16 16:25:00",
    "event_end": "2015-11-16 17:10:00",
    "event_type": "Docker Docker Docker",
    "description": "Attend this session to understand the Docker architecture with respect to providing isolation and security properties to your applications and operating environment.",
    "seats": "0",
    "goers": "113",
    "invite_only": "N",
    "venue": "Level 1, Room 112",
    "id": "693b7537600589771071cefb0b5fc210",
    "venue_id": "375424",
    "speakers": "Nathan McCauley, Diogo Monica"
  },
  {
    "event_key": "65",
    "active": "Y",
    "name": "What's New in Docker Trusted Registry",
    "event_start": "2015-11-17 14:25:00",
    "event_end": "2015-11-17 15:10:00",
    "event_type": "Docker Docker Docker",
    "description": "Docker Trusted Registry allows you to easily run and manage a private registry on-premise or in your VPC. &nbsp;Attend this session to learn more about the new capabilities to improve how to manage your images and your Dockerized apps.",
    "seats": "0",
    "goers": "29",
    "invite_only": "N",
    "venue": "Level 1, Room 112",
    "id": "6c322e9f2222a1c92bf26ae77b0800d5",
    "venue_id": "375424",
    "speakers": "Rajat Goel, Jon Chu"
  },
  {
    "event_key": "35",
    "active": "Y",
    "name": "DNS Service Discovery for Docker Swarm Clusters",
    "event_start": "2015-11-16 16:25:00",
    "event_end": "2015-11-16 17:10:00",
    "event_type": "Wild Cards",
    "description": "DNS-based dynamic service discovery is still an unsolved problem for Docker Swarm. In this talk we will talk about a new open source project by Microsoft: &ldquo;wagl&rdquo; a minimalist DNS service discovery solution built specifically Docker Swarm Clusters. It takes a single command to set up and works out of the box.<br \/><br \/>wagl is open source at:&nbsp;<a href=\"https:\/\/github.com\/ahmetalpbalkan\/wagl\" target=\"_blank\">https:\/\/github.com\/ahmetalpbalkan\/wagl<\/a><br \/><br \/>wagl allows developers to use domain names such as&nbsp;<a href=\"http:\/\/api.billing.swarm\/\" target=\"_blank\">http:\/\/api.billing.swarm<\/a>&nbsp;or memcached.swarm:11211 in their applications that are magically resolved into IP addresses of containers spread all over&nbsp; the Swarm cluster.<br \/><br \/>The session will also review other means of Service Discovery, use cases of Swarm and there will be a demo of creating Docker Swarm Clusters in Azure in just a few clicks.<br \/>",
    "seats": "0",
    "goers": "51",
    "invite_only": "N",
    "venue": "Level 1, Room 113",
    "id": "723decd3c204c37f56d4270950c6b002",
    "venue_id": "375421",
    "speakers": "Ahmet Alp Balkan"
  },
  {
    "event_key": "43",
    "active": "Y",
    "name": "It's in the game: The path to micro-services at Electronic Arts with Docker",
    "event_start": "2015-11-17 15:55:00",
    "event_end": "2015-11-17 16:40:00",
    "event_type": "Use Case",
    "description": "Learn how Docker can be used to achieve near bare-metal performance and a scale-out architecture that enables game backends to scale and stay responsive during load spikes. Game popularity can change with every feature and content pack release, and IBM and Electronic Arts have transitioned a mobile game engine to leverage Docker to enable rapid rollouts while handling more game users. In this session you'll learn design tips from the development of this next-gen gaming platform in an industry where user loyalty and performance are everything. Docker packaging of the game services is enabling a transition to a more flexible, micro-service based architecture, and this session will discuss the development lessons learned during that transition as well as the transition to using Docker in production.&nbsp;<br \/>",
    "seats": "0",
    "goers": "73",
    "invite_only": "N",
    "venue": "Level 1, Room 114",
    "id": "724e14d01959052ff2464e8aa8cd2e80",
    "venue_id": "378155",
    "speakers": "Andrew Hately, Scott Porter"
  },
  {
    "event_key": "5",
    "active": "Y",
    "name": "General Session ",
    "event_start": "2015-11-16 09:00:00",
    "event_end": "2015-11-16 11:15:00",
    "event_type": "General Session",
    "seats": "0",
    "goers": "194",
    "invite_only": "N",
    "venue": "Auditorium",
    "id": "740877503e14fcc54f919055a51bab72",
    "venue_id": "378151"
  },
  {
    "event_key": "45",
    "active": "Y",
    "name": "Lightning Talks: CloudBees, Ruxit, Cloudsoft",
    "event_start": "2015-11-16 16:25:00",
    "event_end": "2015-11-16 17:10:00",
    "event_type": "Ecosystem",
    "description": "<strong>1. Build, Publish, Deploy and Test docker images and containers with Jenkins Workflow &shy; CI for&nbsp;Docker! Presented by Nigel Harniman, Senior Solutions Architect at CloudBees<\/strong><br \/><em>This lightning talk will show you how simple it is to apply CI to the creation of Docker images,&nbsp;ensuring that each time the source is changed, a new image is created, tagged, and published. I&nbsp;will then show how easy it is to then deploy containers from this image and run tests to verify&nbsp;the behaviour.<br \/><\/em><em><br \/><\/em><strong>2.&nbsp;Monitoring and managing dynamic Docker environments, <strong>Presented by Alois Reitbauer,&nbsp;Chief Evangelist,&nbsp;<\/strong>Ruxit<br \/><\/strong><em>This talk provides detailed insights into how to manage large-scale production Docker environments. We will cover how to tune your containerised micro services for ideal performance, validate automated deployments with Marathon and Mesos and tune and manage the deployment complexity of hundreds of nodes. Last but not least we will demonstrate how easy it is to get up and running monitoring Docker using Ruxit.<br \/><br \/><\/em><strong>3.&nbsp;See Multi-Container Apps spanning Docker, Mesos &amp; OpenStack! <strong>Presented by Andrew Kennedy, Senior Software Engineer at Cloudsoft&nbsp;<\/strong><br \/><\/strong><em>Roll up! Roll up! Before your very eyes Andrew will use Apache Brooklyn powered Clocker to deploy and manage multi-container applications transparently spanning - Docker, Mesos and OpenStack.<\/em><br \/>&nbsp;",
    "seats": "0",
    "goers": "32",
    "invite_only": "N",
    "venue": "Level 1, Room 118-119",
    "id": "7a868e07a8bb8f47b3af9d20eaff92a3",
    "venue_id": "378153",
    "speakers": "Andrew Kennedy, Nigel Harniman, Alois Reitbauer"
  },
  {
    "event_key": "58",
    "active": "Y",
    "name": "Getting started with Docker",
    "event_start": "2015-11-16 11:45:00",
    "event_end": "2015-11-16 12:30:00",
    "event_type": "Docker Docker Docker",
    "description": "Are you new to Docker? &nbsp;Attend this session to get an overview of the Docker tools, capabilities, what&rsquo;s new and a demo of using the Docker Toolbox to build your first application.",
    "seats": "0",
    "goers": "36",
    "invite_only": "N",
    "venue": "Level 1, Room 112",
    "id": "7bb5d67bde406f507353ab12b5cb34ad",
    "venue_id": "375424",
    "speakers": "Sam Alba"
  },
  {
    "event_key": "24",
    "active": "Y",
    "name": "Cgroups, namespaces, and beyond: what are containers made from?",
    "event_start": "2015-11-16 14:55:00",
    "event_end": "2015-11-16 15:40:00",
    "event_type": "Black Belt Tech",
    "description": "Linux containers are different from Solaris Zones or BSD Jails: they use discrete kernel features like cgroups, namespaces, SELinux, and more. We will describe those mechanisms in depth, as well as demo how to put them together to produce a container. We will also highlight how different container runtimes compare to each other.&nbsp;",
    "seats": "0",
    "goers": "83",
    "invite_only": "N",
    "venue": "Level 1, Room 111",
    "id": "7c2e184e61e09d3c66309ec5d6d90ef0",
    "venue_id": "378156",
    "speakers": "Jérôme Petazzoni"
  },
  {
    "event_key": "12",
    "active": "Y",
    "name": "Happy Hour & Exhibit Hours",
    "event_start": "2015-11-16 18:05:00",
    "event_end": "2015-11-16 19:30:00",
    "event_type": "Party",
    "description": "Join us for a Happy Hour Sponosred by Joyent!",
    "media_url": "http:\/\/schd.ws\/hosted_files\/dockerconeu2015\/d6\/Joyent.png",
    "seats": "0",
    "goers": "142",
    "invite_only": "N",
    "venue": "Exhibit Hall 4-8",
    "id": "7c72685cbd736774be2afe0ce1372b7c",
    "venue_id": "378152"
  },
  {
    "event_key": "21",
    "active": "Y",
    "name": "Break ",
    "event_start": "2015-11-17 15:10:00",
    "event_end": "2015-11-17 15:55:00",
    "event_type": "break",
    "seats": "0",
    "goers": "100",
    "invite_only": "N",
    "venue": "Exhibit Hall 4-8",
    "id": "7f80d7f455ad176d24d9f4168ec873a5",
    "venue_id": "378152"
  },
  {
    "event_key": "62",
    "active": "Y",
    "name": "Docker Networking Deep Dive",
    "event_start": "2015-11-16 17:20:00",
    "event_end": "2015-11-16 18:05:00",
    "event_type": "Docker Docker Docker",
    "description": "Attend this session to learn about Docker Networking architecture, Container Network Model, plugins and get a demo.",
    "seats": "0",
    "goers": "121",
    "invite_only": "N",
    "venue": "Level 1, Room 112",
    "id": "8833747d5f0db5739c70982016003a5f",
    "venue_id": "375424",
    "speakers": "Jana Radhakrishnan, David Tucker"
  },
  {
    "event_key": "29",
    "active": "Y",
    "name": "Swarming Spark applications",
    "event_start": "2015-11-16 14:55:00",
    "event_end": "2015-11-16 15:40:00",
    "event_type": "Use Case",
    "description": "&nbsp;We built Zoe, an open source user-facing service that ties together Spark, a data-intensive framework for big data computation, and Swarm, the Docker clustering system. It targets data scientists who need to run their data analysis applications without having to worry about systems details. Zoe can execute long running Spark jobs, but also Scala or iPython interactive notebooks and streaming applications, covering the full Spark development cycle. When a computation is finished, resources are automatically freed and available for other uses, since all processes are run in Docker containers.&nbsp;\r\n<p>In this talk we are going to present why Zoe, the Container Analytics as a Service, was born, its architecture and the problems it tries to solve. Zoe would not be there without Swarm and Docker and we will also talk about some of the stumbling blocks we encountered and the solutions we found, in particular in transparently connecting Docker hosts through a physical network. Zoe was born as a research prototype, but is now stable and is currently being used to run real jobs from users in our research institution. Application scheduling on top of Swarm and optimized container placement will also be covered during the presentation.&nbsp;<\/p>",
    "seats": "0",
    "goers": "31",
    "invite_only": "N",
    "venue": "Level 1, Room 114",
    "id": "88d8ac8cc2193aec4cf73caa7ff76e2b",
    "venue_id": "378155",
    "speakers": "Daniele Venzano"
  },
  {
    "event_key": "11",
    "active": "Y",
    "name": "Experiences with AWS immutable deploys and job processing",
    "event_start": "2015-11-16 16:25:00",
    "event_end": "2015-11-16 17:10:00",
    "event_type": "Black Belt Tech",
    "description": "How Docker is used at Gilt: At Gilt we use Docker primarily as a unit of immutability and to allow a standard way of deploying all kinds of software as opposed to its container properties.&nbsp;<br \/><br \/>Why Gilt built Ionroller: An overview of the problems we tried to solve with Ionroller and immutable deploys. Pitfalls we've encountered with immutable deployments since Ionroller saw adoption in Gilt. Will cover issues such as DNS traffic migration, utilisation of resources ELBs not warmed up properly, Elasticbeanstalk using Nginx as proxy etc. Our experiences with Cloudformation and Codedeploy as an alternative to Ionroller and Elasticbeanstalk.&nbsp;<br \/><br \/>Jobs: How we used to do batch jobs. Solutions we considered such as Mesos and Chronos. An overview of Sundial, an in house solution we built in the last few months and hope to open source for running containerized Docker jobs on Amazon ECS and why we chose it as our preferred solution.&nbsp;",
    "seats": "0",
    "goers": "50",
    "invite_only": "N",
    "venue": "Level 1, Room 111",
    "id": "950bf654604ac23bbaf9b5cfaef5a55c",
    "venue_id": "378156",
    "speakers": "Kevin O'Riordan"
  },
  {
    "event_key": "75",
    "active": "Y",
    "name": "Moby Dock's User Swim",
    "event_start": "2015-11-17 14:25:00",
    "event_end": "2015-11-17 15:10:00",
    "event_type": "Contribute & Collaborate",
    "description": "Come find out what Moby has in store for this secret user session. Bring your laptop.&nbsp;",
    "seats": "0",
    "goers": "18",
    "invite_only": "N",
    "venue": "Level 1, Room 120-121",
    "id": "97829f8a88974d0648c5d794080e4076",
    "venue_id": "377082"
  },
  {
    "event_key": "42",
    "active": "Y",
    "name": "Persistent, \"stateful\"services with docker clusters, namespaces and docker volume magic",
    "event_start": "2015-11-17 14:25:00",
    "event_end": "2015-11-17 15:10:00",
    "event_type": "Wild Cards",
    "description": "<p>In this presentation I will show how you can use and abuse namespaces to do things that you might not think were possible in docker. In doing this I will show how you can create a volume bind mount in a running container, and use \"super privileged\" containers to control other containers on the same machine. There are many uses for this, but at it also demystifies what some of the namespaces in linux are, and how they work (hint: everything is files, its unix!).<a href=\"http:\/\/blog.docker.com\/media\/2015\/09\/9548354.jpeg\" target=\"_blank\"><\/a><\/p>\r\n<br \/>",
    "seats": "0",
    "goers": "94",
    "invite_only": "N",
    "venue": "Level 1, Room 113",
    "id": "a0423f3101ae3f4eb63059974b81c40a",
    "venue_id": "375421",
    "speakers": "Michael Neale"
  },
  {
    "event_key": "54",
    "active": "Y",
    "name": "Lightnings talks: Global Hack Day #3 - Top 3 Winning Hacks",
    "event_start": "2015-11-17 14:25:00",
    "event_end": "2015-11-17 15:10:00",
    "event_type": "Ecosystem",
    "description": "1.&nbsp;<a href=\"https:\/\/github.com\/docker\/global-hack-day-3\/pull\/16\" target=\"_blank\">ScaleSwarm<\/a>&nbsp;by&nbsp;<a href=\"https:\/\/twitter.com\/ankushio\" target=\"_blank\">Ankush Agarwal<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/twitter.com\/hmittal83\" target=\"_blank\">Harshit Mittal<\/a>&nbsp;from&nbsp;<a href=\"http:\/\/www.meetup.com\/Docker-Mountain-View\/\" target=\"_blank\">Docker Mountain View<\/a>\r\n<p><em>Swarm and Machine are individually very powerful projects, but when combined, they can work wonders. The project attempts to create a self-scaling cluster using Swarm and Machine. Here, to setup an AWS Docker Auto Scaling cluster, all you need is swarm, machine and Amazon API Keys.<br \/><br \/>2.&nbsp;<a href=\"https:\/\/www.youtube.com\/watch?v=pwf0-_cs6U4\" target=\"_blank\">Container Migration Tool<\/a>&nbsp;by&nbsp;<a href=\"https:\/\/twitter.com\/marcosnils\" target=\"_blank\">Marcos Lilljedahl<\/a>,&nbsp;<a href=\"https:\/\/twitter.com\/xetorthio\" target=\"_blank\">Jonathan Leibiusky<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/twitter.com\/geisbruch\" target=\"_blank\">Gabriel Eisbruch<\/a>&nbsp;from&nbsp;<a href=\"http:\/\/www.meetup.com\/docker-buenos-aires\/\" target=\"_blank\">Docker Buenos Aires<\/a><\/em><\/p>\r\n<p><em>The purpose of the project is to create an external command line tool that can be either used with docker or runC which helps on the task to live migrate containers between different hosts by performing pre-migration validations and allowing to auto-discover suitable target hosts.<br \/><br \/>3. &nbsp;<\/em><a href=\"https:\/\/github.com\/docker\/global-hack-day-3\/pull\/32\" target=\"_blank\">On-demand YARN Clusters<\/a>&nbsp;by&nbsp;<a href=\"https:\/\/twitter.com\/theonlinessd\" target=\"_blank\">Swapnil Daingade<\/a>,&nbsp;<a href=\"https:\/\/twitter.com\/sarjeet\" target=\"_blank\">Sarjeet Singh<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/twitter.com\/kssmitra\" target=\"_blank\">Mitra Kaseebhotla<\/a>&nbsp;from&nbsp;<a href=\"http:\/\/www.meetup.com\/Docker-Santa-Clara\/\" target=\"_blank\">Docker San Jose<\/a><\/p>\r\n<p><em>On demand YARN clusters that have network, compute and storage isolation from each other. Allow administrators managing a cluster of x86 servers to create YARN (hadoop2) clusters on demand. Each tenant YARN cluster should have complete network, compute and storage isolation from others.<\/em><\/p>\r\n<p><em><br \/><br \/>&nbsp;<\/em><\/p>\r\n<br \/>",
    "seats": "0",
    "goers": "12",
    "invite_only": "N",
    "venue": "Level 1, Room 118-119",
    "id": "a2150b1f481be630fdb7885a28235e15",
    "venue_id": "378153",
    "speakers": "Harshit Mittal, Marcos Nils Lilljedahl, Jonathan Leibiusky, Sarjeet Singh, Mitra Kaseebhotla, Swapnil Daingade"
  },
  {
    "event_key": "6",
    "active": "Y",
    "name": "Break",
    "event_start": "2015-11-16 11:00:00",
    "event_end": "2015-11-16 11:45:00",
    "event_type": "break",
    "seats": "0",
    "goers": "106",
    "invite_only": "N",
    "venue": "Exhibit Hall 4-8",
    "id": "a71afcf6f09fd0d97a5e6d0c4eca736d",
    "venue_id": "378152"
  },
  {
    "event_key": "70",
    "active": "Y",
    "name": "Intro to the Docker Project: Engine, Networking, Swarm, Distribution",
    "event_start": "2015-11-16 11:45:00",
    "event_end": "2015-11-16 12:30:00",
    "event_type": "Contribute & Collaborate",
    "description": "As new or prospective contributors, you&rsquo;ll get an introduction to the Docker Project from the very maintainers that manage the engine, networking, swarm, and distribution subprojects. You&rsquo;ll learn about their day to day operations, from project roles to pull request workflows, and how to best keep up to date on the latest merges and roadmap items. Even more importantly, you&rsquo;ll learn how to best start contributing and how to ask for help along the way.",
    "seats": "0",
    "goers": "61",
    "invite_only": "N",
    "venue": "Level 1, Room 120-121",
    "id": "a97d5670e1c13f58086f59800d763b3a",
    "venue_id": "377082"
  },
  {
    "event_key": "68",
    "active": "Y",
    "name": "Microsoft, Docker and our ongoing Journey together",
    "event_start": "2015-11-16 11:45:00",
    "event_end": "2015-11-16 12:30:00",
    "event_type": "Ecosystem",
    "description": "Microsoft has been working with Docker before the 1.0 release. Since day one we've focused on openness and participation with the community and we've come a long way on this journey. We'll look at how we started out together with Docker and take a look at where we are today.  <br \/>This session will cover what Microsoft is doing with Docker in the world of Developer Tools, Docker support in public and private clouds, management tool support and innovation in Windows Containers. We'd like to thank the Docker community for all we've learned, come hear how we are applying that learning in our future work.",
    "seats": "0",
    "goers": "43",
    "invite_only": "N",
    "venue": "Level 1, Room 118-119",
    "id": "ad81097fd267246ca5ba1c947d2e7719",
    "venue_id": "378153",
    "speakers": "Ralph Squillace, Taylor Brown"
  },
  {
    "event_key": "59",
    "active": "Y",
    "name": "The latest in Docker Engine",
    "event_start": "2015-11-16 14:00:00",
    "event_end": "2015-11-16 14:45:00",
    "event_type": "Docker Docker Docker",
    "description": "Attend this session to get the latest capabilities in Docker Engine and how to use them in your application We&rsquo;ll also talk about best practices for using Engine, troubleshooting tips, and cool lesser known features.",
    "seats": "0",
    "goers": "113",
    "invite_only": "N",
    "venue": "Level 1, Room 112",
    "id": "b5b8c249204ad3c328c85329d8bef1c5",
    "venue_id": "375424",
    "speakers": "Jessie Frazelle, Arnaud Porterie"
  },
  {
    "event_key": "38",
    "active": "Y",
    "name": "Cultural Revolution - How to Manage the Changes Docker Brings",
    "event_start": "2015-11-17 11:15:00",
    "event_end": "2015-11-17 12:00:00",
    "event_type": "Wild Cards",
    "description": "<p>The adoption of Docker brings with it many challenges, not all of themtechnical. There is a clear vision of Docker regularly articulated thatencompasses microservices, decoupled applications, agile and continuous deliveryand integration, and DevOps. But the application of this vision often flounders&nbsp;when confronted by the legacy structures of working and successful businesses.<br \/><br \/>This talk draws on the experienced gained from several attempts to lead changewithin technical organisations. The speaker experienced both failure to effectchange (through productization of a bespoke software stack, and the&nbsp;introduction of Erlang), and success (moving to a Continuous Improvement modelof complex software maintenance). These experiences informed a successful drive&nbsp;to Docker as the build and delivery system of a 700-strong software company,with significant efficiency improvements.<br \/>As with most historical revolutions, the integration of the vision with realityresulted in corners cut and principles compromised in order to effect change.This talk is a discussion of the lessons learned from these experiences in an&nbsp;effort to help the listener clarify and overcome the unique challenges their&nbsp;own organisation brings to making change happen.<\/p>",
    "seats": "0",
    "goers": "43",
    "invite_only": "N",
    "venue": "Level 1, Room 113",
    "id": "c0bb5c4a40b6de4ab5b90a2c81ff605e",
    "venue_id": "375421",
    "speakers": "Ian Miell"
  },
  {
    "event_key": "53",
    "active": "Y",
    "name": "Lightning Talks: Univa, ClusterHQ, Rancher",
    "event_start": "2015-11-16 14:55:00",
    "event_end": "2015-11-16 15:40:00",
    "event_type": "Ecosystem",
    "description": "<strong>1. Docker for any type of workload and any IT fnfrastructure, Presented by Fritz Ferstl, CTO Univa<\/strong><br \/><em>This presentation discusses the different types of workloads typical enterprises are required to run, which use cases exist for containerizing them and how leading-edge workload orchestration can be used to deploy, run and manage the containerized workloads or various types or scale-out infrastructures, such as on-premise clusters, public clouds or hybrid clouds.&nbsp;<br \/><br \/><strong>2. <\/strong><\/em><strong>Why should i care about stateful containers?&nbsp;Presented by Luke Mardsen, CTO and Founder, ClusterHQ<\/strong><br \/><em>Microservices are smashing monolithic databases into lots of pieces. CI and CD is making testing those consistently more and more challenging. This talk will explore the problem space and dive into detailed examples, exploring the pros and cons of both ephemeral data stores and storage orchestration.\"&nbsp;<br \/><\/em><strong>\r\n<p>3. Deploy and upgrade Docker applications with a single click, Presented by Darren Shepherd, Co-Founder, Rancher<\/p>\r\n<\/strong><em>Docker has made running complex applications locally a snap, but running applications in production can still be quite challenging. This session will demonstrate how to use Rancher and Docker Compose to deploy and upgrade applications predictably into production environments. &nbsp;Rancher Co-Founder Darren Shepherd will demonstrate how to deploy an application from a Docker compose application catalog into production, and then how to orchestrate an upgrade of that application. &nbsp;<\/em>&nbsp;\r\n<p>&nbsp;<\/p>\r\n<strong><br \/>&nbsp;<\/strong>",
    "seats": "0",
    "goers": "36",
    "invite_only": "N",
    "venue": "Level 1, Room 118-119",
    "id": "c4a7850a8b3da8f1b2d811e1c34cbbf0",
    "venue_id": "378153",
    "speakers": "Fritz Ferstl, Luke Mardsen, Darren Sheperd"
  },
  {
    "event_key": "41",
    "active": "Y",
    "name": "The Glue is the Hard Part: Making a Production-Ready PaaS",
    "event_start": "2015-11-17 14:25:00",
    "event_end": "2015-11-17 15:10:00",
    "event_type": "Use Case",
    "description": "<p>Docker is an amazing technology. In particular, its build-once-run-anywhere model unlocks the world of cluster schedulers like Mesos and Kubernetes. These solve many of the problems of running high-scale websites, but introduce new challenges that need addressing.&nbsp;<br \/><br \/>In this talk, Evan will describe PaaSTA, a PaaS built on top of open&shy; source tools including Docker, Mesos, Marathon, and Chronos. PaaSTA provides tooling for developers to quickly turn their microservice into a monitored, highly available application spanning multiple datacenters and cloud regions. Evan will give an overview of the open-source technologies that power PaaSTA, discuss how Yelp has glued these together to give developers control without burdening them with the complexities of the infrastructure, and show the workflow used by developers to update and maintain their services on PaaSTA.&nbsp;<\/p>",
    "seats": "0",
    "goers": "75",
    "invite_only": "N",
    "venue": "Level 1, Room 114",
    "id": "ce621d2e703d3faaf57f7f3913c25689",
    "venue_id": "378155",
    "speakers": "Evan Krall"
  },
  {
    "event_key": "23",
    "active": "Y",
    "name": "General Session ",
    "event_start": "2015-11-17 16:45:00",
    "event_end": "2015-11-17 17:45:00",
    "event_type": "General Session",
    "description": "The grand finale of DockerCon will have something for everyone.&nbsp; This&nbsp;closing&nbsp;session will showcase cool hacks from the community that bend the imagination and push innovation.&nbsp;",
    "seats": "0",
    "goers": "149",
    "invite_only": "N",
    "venue": "Auditorium",
    "id": "d2b67118ff0074cce4d2bfb52ea9cced",
    "venue_id": "378151"
  },
  {
    "event_key": "72",
    "active": "Y",
    "name": "Meet the Docker Maintainers: Engine, Networking, Swarm, Distribution",
    "event_start": "2015-11-17 11:15:00",
    "event_end": "2015-11-17 12:00:00",
    "event_type": "Contribute & Collaborate",
    "description": "Existing and advanced contributors can meet the engine, networking, swarm, and distribution maintainers to chat about ongoing design decisions and issues, open pull requests, and open areas for contributor help. This is a great chance to get more involved and gain an understanding of project initiatives that goes deeper than Github comments. &nbsp;&nbsp;",
    "seats": "0",
    "goers": "34",
    "invite_only": "N",
    "venue": "Level 1, Room 120-121",
    "id": "d5f3ed27e64dd5723b74769d84d45144",
    "venue_id": "377082"
  },
  {
    "event_key": "73",
    "active": "Y",
    "name": "Meet the Docker Maintainers: Machine, Kitematic, Compose",
    "event_start": "2015-11-17 15:55:00",
    "event_end": "2015-11-17 16:40:00",
    "event_type": "Contribute & Collaborate",
    "description": "Existing and advanced contributors can meet the machine, kitematic, and compose maintainers to chat about ongoing design decisions and issues, open pull requests, and open areas for contributor help. This is a great chance to get more involved and gain an understanding of project initiatives that goes deeper than Github comments.",
    "seats": "0",
    "goers": "16",
    "invite_only": "N",
    "venue": "Level 1, Room 120-121",
    "id": "d68ee9325f65f345485bb43100ab5240",
    "venue_id": "377082"
  },
  {
    "event_key": "40",
    "active": "Y",
    "name": "Docker Monitoring",
    "event_start": "2015-11-17 13:30:00",
    "event_end": "2015-11-17 14:15:00",
    "event_type": "Wild Cards",
    "description": "<p>Do you know the performance of your containers or Docker Hosts? I will show you how to get up and running quickly with 2 different Open Source Docker Monitoring solutions. We will quickly cover Docker Stats as the basis and discover how Google cAdvisor gathers metrics for our 2 solutions. We will then build upon this basis to build a Docker Monitoring solution with cAdvisor+InfluxDB+Grafana and then cAdvisor+Prometheus and create dashboards based on the gathered monitoring metrics with Grafna and Prometheus.<\/p>",
    "seats": "0",
    "goers": "92",
    "invite_only": "N",
    "venue": "Level 1, Room 113",
    "id": "db6ac3c90c8aba603ce77738519814c5",
    "venue_id": "375421",
    "speakers": "Brian Christner"
  },
  {
    "event_key": "44",
    "active": "Y",
    "name": "The missing piece : when Docker networking and services finally unleashes software architecture 2.0",
    "event_start": "2015-11-17 15:55:00",
    "event_end": "2015-11-17 16:40:00",
    "event_type": "Wild Cards",
    "description": "Docker now provides several building blocks, combining engine, clustering, and componentization, while the new networking and service features enable many new usecases such as multi-tenancy.<br \/><br \/>In this session, you will first discover the new experimental networking and service features expected soon, and then drift rapidly to software architecture, explaining how a complete Docker stack unleashes microservices paradigms.<br \/>",
    "seats": "0",
    "goers": "96",
    "invite_only": "N",
    "venue": "Level 1, Room 113",
    "id": "dc271200ee9e3845c7271a42efe46e7a",
    "venue_id": "375421",
    "speakers": "Adrien Blind, Laurent Grangeau"
  },
  {
    "event_key": "34",
    "active": "Y",
    "name": "Finding a Theory of the Universe with Docker and Volunteer Computers",
    "event_start": "2015-11-16 17:20:00",
    "event_end": "2015-11-16 18:05:00",
    "event_type": "Use Case",
    "description": "Cosmology@Home is a project which uses volunteer computing to analyze cosmological data and answer questions about our universe such as \"how much dark matter is there?\" and \"under what conditions did the Big Bang occur?\" We recently began using Docker by taking each job which we would normally send to our volunteer computers, and packaging it up inside a Docker container. The volunteer computers themselves come from interested users all over the world who download and run the software allowing them to become volunteers (called BOINC). The system is working exceedingly well and using Docker has made it massively easier for us to develop and run it. I will explain some of the technical details of the implementation, which involves a customized boot2docker ISO, as well give a brief summary of the scientific questions we are trying to answer and how these results made possible by Docker are helping analyze data from, e.g. the European Space Agency's Planck satellite.&nbsp;<br \/>",
    "seats": "0",
    "goers": "14",
    "invite_only": "N",
    "venue": "Level 1, Room 114",
    "id": "e0f18bf2df741dbc649166e16240963c",
    "venue_id": "378155",
    "speakers": "Dr. Marius Millea"
  },
  {
    "event_key": "20",
    "active": "Y",
    "name": "Green Font, Black Background – Docker Security by Example",
    "event_start": "2015-11-17 13:30:00",
    "event_end": "2015-11-17 14:15:00",
    "event_type": "Black Belt Tech",
    "description": "<p>In this session, you will learn everything you need to know about docker security best practices. We will cover how to write clean Dockerfiles and trim down on your base images. We will go over the runtime security settings you can and should apply to your running containers, go over a few examples around monitoring and incident respo&nbsp;nse and will end up demoing image signing and verification in Docker.<\/p>\r\n<p>This is a no-slides session, and the console will be the only thing up on the screen.<\/p>",
    "seats": "0",
    "goers": "72",
    "invite_only": "N",
    "venue": "Level 1, Room 111",
    "id": "e1030d6dcea1fca30151b433cc51cbb9",
    "venue_id": "378156",
    "speakers": "Nathan McCauley, Diogo Monica"
  },
  {
    "event_key": "57",
    "active": "Y",
    "name": "Lightning talks: ING, Accenture, Apcera",
    "event_start": "2015-11-17 15:55:00",
    "event_end": "2015-11-17 16:40:00",
    "event_type": "Ecosystem",
    "description": "<strong>1.&nbsp;<strong>Full Stack Testing using Docker Compose and Gradle<\/strong> by&nbsp;Ernst Naezer &amp;&nbsp;Quinten Krijger &nbsp;<br \/><br \/><\/strong>At ING we build financial scenario planning software. Using Docker and Docker Compose we develop, test and host our application consisting of multiple containers. <br \/><br \/>This talk focuses on how we test our software stack. We use Docker Compose to inject components that stub services or simulate infrastructure failures. We developed and open sourced a Gradle plugin to take care of the heavy lifting, allowing us to test the images using either unit tests defined in code or by a dedicated test image.<br \/><br \/>The shown techniques fully support the agile process, by giving instant feedback on the features under simultaneous development against the entire application stack. We are now confident when merging a feature to master.<strong><br \/><br \/>2. Presentation by Accenture<\/strong><strong><br \/><br \/>3. Authentication and Policy Enforcement for Docker by&nbsp;Josh Ellithorpe, Apcera's Lead Software Architect&nbsp;<br \/><br \/><\/strong>Docker has become an important tool for both startups and the enterprise; providing an easy way to package up and deploy applications and services. As organizations prepare to move to production, they are looking for ways to extend Docker and employ additional security and policy controls for their deployments. This talk will cover:<br \/>* Adding first class authentication using OAuth2, LDAP, Crowd and Kerberos<br \/>* Extending Docker deployments with policy and governance<br \/>* Securing network perimeter of Docker workloads while providing multiple multi-host networking options.<br \/>The Apcera Platform has always strived to be the best environment for deploying Docker workloads in production. This talk will cover our thinking around secure deployments and how we have extended Docker for our customers.<br \/>&nbsp;",
    "seats": "0",
    "goers": "20",
    "invite_only": "N",
    "venue": "Level 1, Room 118-119",
    "id": "e175459e1baadc40d7385fc69983efab",
    "venue_id": "378153",
    "speakers": "Quinten Krijger, Josh Ellithorpe"
  },
  {
    "event_key": "16",
    "active": "Y",
    "name": "General Session ",
    "event_start": "2015-11-17 09:00:00",
    "event_end": "2015-11-17 10:30:00",
    "event_type": "General Session",
    "seats": "0",
    "goers": "174",
    "invite_only": "N",
    "venue": "Auditorium",
    "id": "e1aaa4ceb8a363840dfa7dec4a691c71",
    "venue_id": "378151"
  },
  {
    "event_key": "71",
    "active": "Y",
    "name": "Introduction to the Docker Project: Machine, Kitematic, Compose",
    "event_start": "2015-11-16 16:25:00",
    "event_end": "2015-11-16 17:10:00",
    "event_type": "Contribute & Collaborate",
    "description": "As new or prospective contributors, you&rsquo;ll get an introduction to the Docker Project from the very maintainers that manage the machine, kitematic, and compose subprojects. You&rsquo;ll learn about their day to day operations, from project roles to pull request workflows, and how to best keep up to date on the latest merges and roadmap items. Even more importantly, you&rsquo;ll learn how to best start contributing and how to ask for help along the way.",
    "seats": "0",
    "goers": "21",
    "invite_only": "N",
    "venue": "Level 1, Room 120-121",
    "id": "e24a4cb52e5f110d89dca3a774992c56",
    "venue_id": "377082"
  },
  {
    "event_key": "3",
    "active": "Y",
    "name": "Registration ",
    "event_start": "2015-11-16 08:00:00",
    "event_end": "2015-11-16 18:00:00",
    "event_type": "Registration",
    "seats": "0",
    "goers": "64",
    "invite_only": "N",
    "venue": "Entrance Hall",
    "id": "e5dee3e2aec2d65af1530562d598e75c",
    "venue_id": "378150"
  },
  {
    "event_key": "50",
    "active": "Y",
    "name": "Lightning Talks: Google, Raspberry Pi Challenge Winner, Resin.io",
    "event_start": "2015-11-16 17:20:00",
    "event_end": "2015-11-16 18:05:00",
    "event_type": "Ecosystem",
    "description": "<strong>1. Containerize your developer experience, Presented by Francesc Campoy<br \/><\/strong><br \/><em>This talk covers a range of situations where containers can improve the developer experience by providing a repeatable and consistent environment. This includes from how to help your users become your contributors, to how to install tools in your machine without really installing anything, or how containers can be the killer tool for the polyglot programmer.&nbsp;<\/em>\r\n<p><em>The goal is to give an overview of the techniques that power these use cases and to inspire the audience to improve their communities by leveraging the power of Docker.&nbsp;<br \/><br \/><\/em><strong>2. Breaking the RPiDocker Challenge by Nicolas de Loof, Yoann Dubreuil, Damien Duportal<br \/><br \/><\/strong>Docker claim to be a lightweight virtualization solution, and indeed it so light you can play on tiny hardware like Raspberry Pi and run Hundred containers. Hypriot demonstrated running 500 of them, but can we do more ? The RPiDocker challenge was proposed to get the community study some more hacks to get more and more containers running on the Pi. During this session we will explain how we went into this effort, and eventually where able to run 2740 web servers ... on a RapsberryPi.&nbsp;<br \/><br \/><strong>3. Docker on IoT devices by Shaun Mulligan<\/strong><br \/><br \/>The Resin.io team has brought Docker to IoT in a big way. Shaun will walk through the ways in which his team has enabled&nbsp;<a href=\"http:\/\/resin.io\/\" target=\"_blank\">resin.io<\/a>'s container-powered edge device management platform to work with all sorts of linux-based devices. These include the Raspberry Pi, Beaglebone, Intel Edison, NUC, Hummingboard and countless custom boards. This talk will include an overview of the toolchain (Docker, Yocto, meta-resin), the approach, the customer use cases, and how you can get involved.&nbsp;<\/p>",
    "seats": "0",
    "goers": "29",
    "invite_only": "N",
    "venue": "Level 1, Room 118-119",
    "id": "e8ccafed70f9de0b006b7813ebf7f36e",
    "venue_id": "378153",
    "speakers": "Francesc Campoy, Nicolas De Loof, Yoann Dubreuil, Damien Duportal, Shaun Mulligan"
  },
  {
    "event_key": "7",
    "active": "Y",
    "name": "Tor + Docker = Anonymous <3",
    "event_start": "2015-11-16 11:45:00",
    "event_end": "2015-11-16 12:30:00",
    "event_type": "Black Belt Tech",
    "description": "This talk is inspired by the&nbsp;<a href=\"https:\/\/blog.jessfraz.com\/\" target=\"_blank\">series of blog posts<\/a>&nbsp;Jessie wrote. This talk will cover running tor relays in containers, routing all traffic through tor in a container, running a tor socks proxy in a container, and lastly running a Docker native networking plugin to route all container traffic through tor.",
    "seats": "0",
    "goers": "45",
    "invite_only": "N",
    "venue": "Level 1, Room 111",
    "id": "effa272daa0f509b3d365afe14c1b955",
    "venue_id": "378156",
    "speakers": "Jessie Frazelle"
  },
  {
    "event_key": "2",
    "active": "Y",
    "name": "Welcome Reception & Exhibit Hours",
    "event_start": "2015-11-15 18:00:00",
    "event_end": "2015-11-15 19:30:00",
    "event_type": "Party",
    "seats": "0",
    "goers": "86",
    "invite_only": "N",
    "venue": "Exhibit Hall 4-8",
    "id": "f28f69b2e4572aeb5d080f251253f97d",
    "venue_id": "378152"
  },
  {
    "event_key": "26",
    "active": "Y",
    "name": "Windows Server Containers – How we got here and architecture deep dive",
    "event_start": "2015-11-17 14:25:00",
    "event_end": "2015-11-17 15:10:00",
    "event_type": "Black Belt Tech",
    "description": "<p>Porting Docker for Windows is no small feat.&nbsp; The technology behind Docker today takes advantage of Linux capabilities like namespaces and cgroups.&nbsp; For native containers to exist on Windows and to have a Docker Engine for Windows, first similar primitives needed to be developed into the Windows operating system.&nbsp; In this session we will explain these Windows primitives in relation to similar primitives in Linux and other architectural changes on the OS and Engine side to make containerization&nbsp;possible.&nbsp; The process of porting includes not only the technology but also open source community interactions&nbsp;and cultural changes to enable this development.&nbsp; And of course there will be a cool demo&hellip;<a href=\"http:\/\/blog.docker.com\/media\/2015\/09\/9548354.jpeg\" target=\"_blank\"><\/a><\/p>\r\n<br \/>",
    "seats": "0",
    "goers": "47",
    "invite_only": "N",
    "venue": "Level 1, Room 111",
    "id": "f39930dbbfac7c4c3a8eb785989b4c54",
    "venue_id": "378156",
    "speakers": "Arnaud Porterie, John Starks"
  }
]